In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("../files/titanic.csv")

In [3]:
data.sample(5)

    Cabin    Ticket number  Survived
340    F2    230080      A         1
704   NaN    350025      5         0
632   B50     13214      5         1
375   NaN  PC 17604      1         1
522   NaN      2624      2         0

In [4]:
data.number.unique()

array(['5', '3', '6', 'A', '2', '1', '4'], dtype=object)

pd.to_numeric ==> Converts values to numeric(int or float)
erros="coerce" ==> Converts non-numeric values to NaN (avoids errors)
downcast="integer" ==> Converts numbers to the smallest possible integer type (int8, int16, etc.) to save memory

In [7]:
# extract numerical part
data["number_numerical"] = pd.to_numeric(
    data["number"], errors="coerce", downcast="integer"
)

data.head()

  Cabin            Ticket number  Survived  number_numerical
0   NaN         A/5 21171      5         0               5.0
1   C85          PC 17599      3         1               3.0
2   NaN  STON/O2. 3101282      6         1               6.0
3  C123            113803      3         1               3.0
4   NaN            373450      A         0               NaN

np.where(condition, value_if_true, value_if_false) ==> Applies a condition-based transformation.

In [8]:
# extract categorical part
data["number_categotrial"] = np.where(
    data["number_numerical"].isnull(), data["number"], np.nan
)

data.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categotrial
0,NaN,A/5 21171,5,0,5.0,NaN
1,C85,PC 17599,3,1,3.0,NaN
2,NaN,STON/O2. 3101282,6,1,6.0,NaN
3,C123,113803,3,1,3.0,NaN
4,NaN,373450,A,0,NaN,A

In [9]:
data["Cabin"].nunique()

147

In [ ]:
data["Cabin_numerical"] = data["Cabin"].str.extract("(\d+)")
data["Cabin_categorical"] = data["Cabin"].str[0]